/* Функція s2ab перетворює рядок (string) у формат ArrayBuffer,
який є масивом байтів. Це необхідно для роботи з файлами в JavaScript,
оскільки ArrayBuffer дозволяє зберігати дані у вигляді двійкових чисел,
що підходить для формування файлів різних форматів, як - от Excel(xlsx). 
Назва походить від " string to array buffer "*/

export const s2ab = (s) => {
    const buf = new ArrayBuffer(s.length); // Створюється новий ArrayBuffer, розміром рівним довжині рядка s. Це створює місце для зберігання двійкових даних.
    const view = new Uint8Array(buf);   // Uint8Array є типізованим масивом, який дає доступ до кожного байта ArrayBuffer. Це дозволяє зручно працювати з даними на рівні байтів.
    for (let i = 0; i < s.length; i++) {
        view[i] = s.charCodeAt(i) & 0xFF;
    } // Цикл для конвертації символів у байти: s.charCodeAt(i) повертає Unicode-код символу на позиції i в рядку s. & 0xFF забезпечує, що ми отримуємо тільки останні 8 біт кожного символу. Це дає значення від 0 до 255, що сумісно з Uint8Array.
    return buf; 
    /* Повернення ArrayBuffer: Після завершення циклу view містить двійкові 
    представлення символів рядка, і функція повертає ArrayBuffer (buf), 
    який зберігає ці дані у форматі байтів. */
}
